Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hefc.h
/* -------- HEFC_HECC_CR5 : (HEFC Offset: 0x114) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 5 -------- */
#define HEFC_HECC_CR5_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR5) ECC protection enable Position */
#define HEFC_HECC_CR5_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR5_ENABLE_Pos)               /**< (HEFC_HECC_CR5) ECC protection enable Mask */
#define HEFC_HECC_CR5_ENABLE(value)           (HEFC_HECC_CR5_ENABLE_Msk & ((value) << HEFC_HECC_CR5_ENABLE_Pos))
#define HEFC_HECC_CR5_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR5) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR5_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR5_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR5) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR5_TEST_MODE_RD(value)     (HEFC_HECC_CR5_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR5_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR5_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR5) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR5_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR5_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR5) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR5_TEST_MODE_WR(value)     (HEFC_HECC_CR5_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR5_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR5_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR5) reset the fixable error counter Position */
#define HEFC_HECC_CR5_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR5_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR5) reset the fixable error counter Mask */
#define HEFC_HECC_CR5_RST_FIX_CPT(value)      (HEFC_HECC_CR5_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR5_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR5_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR5) reset the un-fixable error counter Position */
#define HEFC_HECC_CR5_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR5_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR5) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR5_RST_NOFIX_CPT(value)    (HEFC_HECC_CR5_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR5_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR5_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR5) BCH ECC enable Position */
#define HEFC_HECC_CR5_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR5_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR5) BCH ECC enable Mask */
#define HEFC_HECC_CR5_ECC12_ENABLE(value)     (HEFC_HECC_CR5_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR5_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR5_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR5) Register Mask  */


/* -------- HEFC_HECC_CR6 : (HEFC Offset: 0x118) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 6 -------- */
#define HEFC_HECC_CR6_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR6) ECC protection enable Position */
#define HEFC_HECC_CR6_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR6_ENABLE_Pos)               /**< (HEFC_HECC_CR6) ECC protection enable Mask */
#define HEFC_HECC_CR6_ENABLE(value)           (HEFC_HECC_CR6_ENABLE_Msk & ((value) << HEFC_HECC_CR6_ENABLE_Pos))
#define HEFC_HECC_CR6_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR6) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR6_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR6_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR6) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR6_TEST_MODE_RD(value)     (HEFC_HECC_CR6_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR6_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR6_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR6) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR6_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR6_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR6) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR6_TEST_MODE_WR(value)     (HEFC_HECC_CR6_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR6_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR6_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR6) reset the fixable error counter Position */
#define HEFC_HECC_CR6_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR6_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR6) reset the fixable error counter Mask */
#define HEFC_HECC_CR6_RST_FIX_CPT(value)      (HEFC_HECC_CR6_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR6_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR6_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR6) reset the un-fixable error counter Position */
#define HEFC_HECC_CR6_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR6_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR6) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR6_RST_NOFIX_CPT(value)    (HEFC_HECC_CR6_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR6_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR6_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR6) BCH ECC enable Position */
#define HEFC_HECC_CR6_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR6_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR6) BCH ECC enable Mask */
#define HEFC_HECC_CR6_ECC12_ENABLE(value)     (HEFC_HECC_CR6_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR6_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR6_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR6) Register Mask  */


/* -------- HEFC_HECC_CR7 : (HEFC Offset: 0x11C) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 7 -------- */
#define HEFC_HECC_CR7_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR7) ECC protection enable Position */
#define HEFC_HECC_CR7_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR7_ENABLE_Pos)               /**< (HEFC_HECC_CR7) ECC protection enable Mask */
#define HEFC_HECC_CR7_ENABLE(value)           (HEFC_HECC_CR7_ENABLE_Msk & ((value) << HEFC_HECC_CR7_ENABLE_Pos))
#define HEFC_HECC_CR7_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR7) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR7_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR7_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR7) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR7_TEST_MODE_RD(value)     (HEFC_HECC_CR7_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR7_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR7_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR7) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR7_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR7_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR7) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR7_TEST_MODE_WR(value)     (HEFC_HECC_CR7_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR7_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR7_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR7) reset the fixable error counter Position */
#define HEFC_HECC_CR7_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR7_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR7) reset the fixable error counter Mask */
#define HEFC_HECC_CR7_RST_FIX_CPT(value)      (HEFC_HECC_CR7_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR7_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR7_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR7) reset the un-fixable error counter Position */
#define HEFC_HECC_CR7_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR7_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR7) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR7_RST_NOFIX_CPT(value)    (HEFC_HECC_CR7_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR7_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR7_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR7) BCH ECC enable Position */
#define HEFC_HECC_CR7_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR7_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR7) BCH ECC enable Mask */
#define HEFC_HECC_CR7_ECC12_ENABLE(value)     (HEFC_HECC_CR7_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR7_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR7_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR7) Register Mask  */


/* -------- HEFC_HECC_CR8 : (HEFC Offset: 0x120) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 8 -------- */
#define HEFC_HECC_CR8_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR8) ECC protection enable Position */
#define HEFC_HECC_CR8_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR8_ENABLE_Pos)               /**< (HEFC_HECC_CR8) ECC protection enable Mask */
#define HEFC_HECC_CR8_ENABLE(value)           (HEFC_HECC_CR8_ENABLE_Msk & ((value) << HEFC_HECC_CR8_ENABLE_Pos))
#define HEFC_HECC_CR8_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR8) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR8_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR8_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR8) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR8_TEST_MODE_RD(value)     (HEFC_HECC_CR8_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR8_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR8_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR8) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR8_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR8_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR8) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR8_TEST_MODE_WR(value)     (HEFC_HECC_CR8_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR8_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR8_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR8) reset the fixable error counter Position */
#define HEFC_HECC_CR8_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR8_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR8) reset the fixable error counter Mask */
#define HEFC_HECC_CR8_RST_FIX_CPT(value)      (HEFC_HECC_CR8_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR8_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR8_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR8) reset the un-fixable error counter Position */
#define HEFC_HECC_CR8_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR8_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR8) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR8_RST_NOFIX_CPT(value)    (HEFC_HECC_CR8_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR8_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR8_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR8) BCH ECC enable Position */
#define HEFC_HECC_CR8_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR8_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR8) BCH ECC enable Mask */
#define HEFC_HECC_CR8_ECC12_ENABLE(value)     (HEFC_HECC_CR8_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR8_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR8_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR8) Register Mask  */


/* -------- HEFC_HECC_CR9 : (HEFC Offset: 0x124) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 9 -------- */
#define HEFC_HECC_CR9_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR9) ECC protection enable Position */
#define HEFC_HECC_CR9_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR9_ENABLE_Pos)               /**< (HEFC_HECC_CR9) ECC protection enable Mask */
#define HEFC_HECC_CR9_ENABLE(value)           (HEFC_HECC_CR9_ENABLE_Msk & ((value) << HEFC_HECC_CR9_ENABLE_Pos))
#define HEFC_HECC_CR9_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR9) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR9_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR9_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR9) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR9_TEST_MODE_RD(value)     (HEFC_HECC_CR9_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR9_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR9_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR9) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR9_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR9_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR9) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR9_TEST_MODE_WR(value)     (HEFC_HECC_CR9_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR9_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR9_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR9) reset the fixable error counter Position */
#define HEFC_HECC_CR9_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR9_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR9) reset the fixable error counter Mask */
#define HEFC_HECC_CR9_RST_FIX_CPT(value)      (HEFC_HECC_CR9_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR9_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR9_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR9) reset the un-fixable error counter Position */
#define HEFC_HECC_CR9_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR9_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR9) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR9_RST_NOFIX_CPT(value)    (HEFC_HECC_CR9_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR9_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR9_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR9) BCH ECC enable Position */
#define HEFC_HECC_CR9_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR9_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR9) BCH ECC enable Mask */
#define HEFC_HECC_CR9_ECC12_ENABLE(value)     (HEFC_HECC_CR9_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR9_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR9_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR9) Register Mask  */


/* -------- HEFC_HECC_CR10 : (HEFC Offset: 0x128) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 10 -------- */
#define HEFC_HECC_CR10_ENABLE_Pos             _U_(0)                                               /**< (HEFC_HECC_CR10) ECC protection enable Position */
#define HEFC_HECC_CR10_ENABLE_Msk             (_U_(0x1) << HEFC_HECC_CR10_ENABLE_Pos)              /**< (HEFC_HECC_CR10) ECC protection enable Mask */
#define HEFC_HECC_CR10_ENABLE(value)          (HEFC_HECC_CR10_ENABLE_Msk & ((value) << HEFC_HECC_CR10_ENABLE_Pos))
#define HEFC_HECC_CR10_TEST_MODE_RD_Pos       _U_(1)                                               /**< (HEFC_HECC_CR10) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR10_TEST_MODE_RD_Msk       (_U_(0x1) << HEFC_HECC_CR10_TEST_MODE_RD_Pos)        /**< (HEFC_HECC_CR10) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR10_TEST_MODE_RD(value)    (HEFC_HECC_CR10_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR10_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR10_TEST_MODE_WR_Pos       _U_(2)                                               /**< (HEFC_HECC_CR10) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR10_TEST_MODE_WR_Msk       (_U_(0x1) << HEFC_HECC_CR10_TEST_MODE_WR_Pos)        /**< (HEFC_HECC_CR10) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR10_TEST_MODE_WR(value)    (HEFC_HECC_CR10_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR10_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR10_RST_FIX_CPT_Pos        _U_(4)                                               /**< (HEFC_HECC_CR10) reset the fixable error counter Position */
#define HEFC_HECC_CR10_RST_FIX_CPT_Msk        (_U_(0x1) << HEFC_HECC_CR10_RST_FIX_CPT_Pos)         /**< (HEFC_HECC_CR10) reset the fixable error counter Mask */
#define HEFC_HECC_CR10_RST_FIX_CPT(value)     (HEFC_HECC_CR10_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR10_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR10_RST_NOFIX_CPT_Pos      _U_(5)                                               /**< (HEFC_HECC_CR10) reset the un-fixable error counter Position */
#define HEFC_HECC_CR10_RST_NOFIX_CPT_Msk      (_U_(0x1) << HEFC_HECC_CR10_RST_NOFIX_CPT_Pos)       /**< (HEFC_HECC_CR10) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR10_RST_NOFIX_CPT(value)   (HEFC_HECC_CR10_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR10_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR10_ECC12_ENABLE_Pos       _U_(6)                                               /**< (HEFC_HECC_CR10) BCH ECC enable Position */
#define HEFC_HECC_CR10_ECC12_ENABLE_Msk       (_U_(0x1) << HEFC_HECC_CR10_ECC12_ENABLE_Pos)        /**< (HEFC_HECC_CR10) BCH ECC enable Mask */
#define HEFC_HECC_CR10_ECC12_ENABLE(value)    (HEFC_HECC_CR10_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR10_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR10_Msk                    _U_(0x00000077)                                      /**< (HEFC_HECC_CR10) Register Mask  */


/* -------- HEFC_HECC_CR11 : (HEFC Offset: 0x12C) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 11 -------- */
#define HEFC_HECC_CR11_ENABLE_Pos             _U_(0)                                               /**< (HEFC_HECC_CR11) ECC protection enable Position */
#define HEFC_HECC_CR11_ENABLE_Msk             (_U_(0x1) << HEFC_HECC_CR11_ENABLE_Pos)              /**< (HEFC_HECC_CR11) ECC protection enable Mask */
#define HEFC_HECC_CR11_ENABLE(value)          (HEFC_HECC_CR11_ENABLE_Msk & ((value) << HEFC_HECC_CR11_ENABLE_Pos))
#define HEFC_HECC_CR11_TEST_MODE_RD_Pos       _U_(1)                                               /**< (HEFC_HECC_CR11) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR11_TEST_MODE_RD_Msk       (_U_(0x1) << HEFC_HECC_CR11_TEST_MODE_RD_Pos)        /**< (HEFC_HECC_CR11) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR11_TEST_MODE_RD(value)    (HEFC_HECC_CR11_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR11_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR11_TEST_MODE_WR_Pos       _U_(2)                                               /**< (HEFC_HECC_CR11) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR11_TEST_MODE_WR_Msk       (_U_(0x1) << HEFC_HECC_CR11_TEST_MODE_WR_Pos)        /**< (HEFC_HECC_CR11) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR11_TEST_MODE_WR(value)    (HEFC_HECC_CR11_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR11_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR11_RST_FIX_CPT_Pos        _U_(4)                                               /**< (HEFC_HECC_CR11) reset the fixable error counter Position */
#define HEFC_HECC_CR11_RST_FIX_CPT_Msk        (_U_(0x1) << HEFC_HECC_CR11_RST_FIX_CPT_Pos)         /**< (HEFC_HECC_CR11) reset the fixable error counter Mask */
#define HEFC_HECC_CR11_RST_FIX_CPT(value)     (HEFC_HECC_CR11_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR11_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR11_RST_NOFIX_CPT_Pos      _U_(5)                                               /**< (HEFC_HECC_CR11) reset the un-fixable error counter Position */
#define HEFC_HECC_CR11_RST_NOFIX_CPT_Msk      (_U_(0x1) << HEFC_HECC_CR11_RST_NOFIX_CPT_Pos)       /**< (HEFC_HECC_CR11) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR11_RST_NOFIX_CPT(value)   (HEFC_HECC_CR11_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR11_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR11_ECC12_ENABLE_Pos       _U_(6)                                               /**< (HEFC_HECC_CR11) BCH ECC enable Position */
#define HEFC_HECC_CR11_ECC12_ENABLE_Msk       (_U_(0x1) << HEFC_HECC_CR11_ECC12_ENABLE_Pos)        /**< (HEFC_HECC_CR11) BCH ECC enable Mask */
#define HEFC_HECC_CR11_ECC12_ENABLE(value)    (HEFC_HECC_CR11_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR11_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR11_Msk                    _U_(0x00000077)                                      /**< (HEFC_HECC_CR11) Register Mask  */


/* -------- HEFC_HECC_CR12 : (HEFC Offset: 0x130) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 12 -------- */
#define HEFC_HECC_CR12_ENABLE_Pos             _U_(0)                                               /**< (HEFC_HECC_CR12) ECC protection enable Position */
#define HEFC_HECC_CR12_ENABLE_Msk             (_U_(0x1) << HEFC_HECC_CR12_ENABLE_Pos)              /**< (HEFC_HECC_CR12) ECC protection enable Mask */
#define HEFC_HECC_CR12_ENABLE(value)          (HEFC_HECC_CR12_ENABLE_Msk & ((value) << HEFC_HECC_CR12_ENABLE_Pos))
#define HEFC_HECC_CR12_TEST_MODE_RD_Pos       _U_(1)                                               /**< (HEFC_HECC_CR12) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR12_TEST_MODE_RD_Msk       (_U_(0x1) << HEFC_HECC_CR12_TEST_MODE_RD_Pos)        /**< (HEFC_HECC_CR12) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR12_TEST_MODE_RD(value)    (HEFC_HECC_CR12_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR12_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR12_TEST_MODE_WR_Pos       _U_(2)                                               /**< (HEFC_HECC_CR12) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR12_TEST_MODE_WR_Msk       (_U_(0x1) << HEFC_HECC_CR12_TEST_MODE_WR_Pos)        /**< (HEFC_HECC_CR12) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR12_TEST_MODE_WR(value)    (HEFC_HECC_CR12_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR12_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR12_RST_FIX_CPT_Pos        _U_(4)                                               /**< (HEFC_HECC_CR12) reset the fixable error counter Position */
#define HEFC_HECC_CR12_RST_FIX_CPT_Msk        (_U_(0x1) << HEFC_HECC_CR12_RST_FIX_CPT_Pos)         /**< (HEFC_HECC_CR12) reset the fixable error counter Mask */
#define HEFC_HECC_CR12_RST_FIX_CPT(value)     (HEFC_HECC_CR12_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR12_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR12_RST_NOFIX_CPT_Pos      _U_(5)                                               /**< (HEFC_HECC_CR12) reset the un-fixable error counter Position */
#define HEFC_HECC_CR12_RST_NOFIX_CPT_Msk      (_U_(0x1) << HEFC_HECC_CR12_RST_NOFIX_CPT_Pos)       /**< (HEFC_HECC_CR12) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR12_RST_NOFIX_CPT(value)   (HEFC_HECC_CR12_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR12_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR12_ECC12_ENABLE_Pos       _U_(6)                                               /**< (HEFC_HECC_CR12) BCH ECC enable Position */
#define HEFC_HECC_CR12_ECC12_ENABLE_Msk       (_U_(0x1) << HEFC_HECC_CR12_ECC12_ENABLE_Pos)        /**< (HEFC_HECC_CR12) BCH ECC enable Mask */
#define HEFC_HECC_CR12_ECC12_ENABLE(value)    (HEFC_HECC_CR12_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR12_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR12_Msk                    _U_(0x00000077)                                      /**< (HEFC_HECC_CR12) Register Mask  */


