Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hefc.h
/* -------- HEFC_HECC_TESTCB2 : (HEFC Offset: 0x148) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 2 -------- */
#define HEFC_HECC_TESTCB2_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB2) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB2_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB2_TCB_Pos)           /**< (HEFC_HECC_TESTCB2) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB2_TCB(value)          (HEFC_HECC_TESTCB2_TCB_Msk & ((value) << HEFC_HECC_TESTCB2_TCB_Pos))
#define HEFC_HECC_TESTCB2_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB2) Register Mask  */


/* -------- HEFC_HECC_TESTCB3 : (HEFC Offset: 0x14C) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 3 -------- */
#define HEFC_HECC_TESTCB3_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB3) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB3_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB3_TCB_Pos)           /**< (HEFC_HECC_TESTCB3) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB3_TCB(value)          (HEFC_HECC_TESTCB3_TCB_Msk & ((value) << HEFC_HECC_TESTCB3_TCB_Pos))
#define HEFC_HECC_TESTCB3_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB3) Register Mask  */


/* -------- HEFC_HECC_TESTCB4 : (HEFC Offset: 0x150) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 4 -------- */
#define HEFC_HECC_TESTCB4_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB4) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB4_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB4_TCB_Pos)           /**< (HEFC_HECC_TESTCB4) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB4_TCB(value)          (HEFC_HECC_TESTCB4_TCB_Msk & ((value) << HEFC_HECC_TESTCB4_TCB_Pos))
#define HEFC_HECC_TESTCB4_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB4) Register Mask  */


/* -------- HEFC_HECC_TESTCB5 : (HEFC Offset: 0x154) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 5 -------- */
#define HEFC_HECC_TESTCB5_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB5) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB5_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB5_TCB_Pos)           /**< (HEFC_HECC_TESTCB5) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB5_TCB(value)          (HEFC_HECC_TESTCB5_TCB_Msk & ((value) << HEFC_HECC_TESTCB5_TCB_Pos))
#define HEFC_HECC_TESTCB5_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB5) Register Mask  */


/* -------- HEFC_HECC_TESTCB6 : (HEFC Offset: 0x158) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 6 -------- */
#define HEFC_HECC_TESTCB6_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB6) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB6_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB6_TCB_Pos)           /**< (HEFC_HECC_TESTCB6) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB6_TCB(value)          (HEFC_HECC_TESTCB6_TCB_Msk & ((value) << HEFC_HECC_TESTCB6_TCB_Pos))
#define HEFC_HECC_TESTCB6_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB6) Register Mask  */


/* -------- HEFC_HECC_TESTCB7 : (HEFC Offset: 0x15C) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 7 -------- */
#define HEFC_HECC_TESTCB7_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB7) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB7_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB7_TCB_Pos)           /**< (HEFC_HECC_TESTCB7) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB7_TCB(value)          (HEFC_HECC_TESTCB7_TCB_Msk & ((value) << HEFC_HECC_TESTCB7_TCB_Pos))
#define HEFC_HECC_TESTCB7_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB7) Register Mask  */


/* -------- HEFC_HECC_TESTCB8 : (HEFC Offset: 0x160) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 8 -------- */
#define HEFC_HECC_TESTCB8_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB8) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB8_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB8_TCB_Pos)           /**< (HEFC_HECC_TESTCB8) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB8_TCB(value)          (HEFC_HECC_TESTCB8_TCB_Msk & ((value) << HEFC_HECC_TESTCB8_TCB_Pos))
#define HEFC_HECC_TESTCB8_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB8) Register Mask  */


/* -------- HEFC_HECC_TESTCB9 : (HEFC Offset: 0x164) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 9 -------- */
#define HEFC_HECC_TESTCB9_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB9) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB9_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB9_TCB_Pos)           /**< (HEFC_HECC_TESTCB9) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB9_TCB(value)          (HEFC_HECC_TESTCB9_TCB_Msk & ((value) << HEFC_HECC_TESTCB9_TCB_Pos))
#define HEFC_HECC_TESTCB9_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB9) Register Mask  */


/* -------- HEFC_HECC_TESTCB10 : (HEFC Offset: 0x168) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 10 -------- */
#define HEFC_HECC_TESTCB10_TCB_Pos            _U_(0)                                               /**< (HEFC_HECC_TESTCB10) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB10_TCB_Msk            (_U_(0xFFFF) << HEFC_HECC_TESTCB10_TCB_Pos)          /**< (HEFC_HECC_TESTCB10) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB10_TCB(value)         (HEFC_HECC_TESTCB10_TCB_Msk & ((value) << HEFC_HECC_TESTCB10_TCB_Pos))
#define HEFC_HECC_TESTCB10_Msk                _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB10) Register Mask  */


/* -------- HEFC_HECC_TESTCB11 : (HEFC Offset: 0x16C) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 11 -------- */
#define HEFC_HECC_TESTCB11_TCB_Pos            _U_(0)                                               /**< (HEFC_HECC_TESTCB11) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB11_TCB_Msk            (_U_(0xFFFF) << HEFC_HECC_TESTCB11_TCB_Pos)          /**< (HEFC_HECC_TESTCB11) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB11_TCB(value)         (HEFC_HECC_TESTCB11_TCB_Msk & ((value) << HEFC_HECC_TESTCB11_TCB_Pos))
#define HEFC_HECC_TESTCB11_Msk                _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB11) Register Mask  */


/* -------- HEFC_HECC_TESTCB12 : (HEFC Offset: 0x170) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 12 -------- */
#define HEFC_HECC_TESTCB12_TCB_Pos            _U_(0)                                               /**< (HEFC_HECC_TESTCB12) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB12_TCB_Msk            (_U_(0xFFFF) << HEFC_HECC_TESTCB12_TCB_Pos)          /**< (HEFC_HECC_TESTCB12) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB12_TCB(value)         (HEFC_HECC_TESTCB12_TCB_Msk & ((value) << HEFC_HECC_TESTCB12_TCB_Pos))
#define HEFC_HECC_TESTCB12_Msk                _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB12) Register Mask  */


/* -------- HEFC_HECC_TESTCB13 : (HEFC Offset: 0x174) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 13 -------- */
#define HEFC_HECC_TESTCB13_TCB_Pos            _U_(0)                                               /**< (HEFC_HECC_TESTCB13) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB13_TCB_Msk            (_U_(0xFFFF) << HEFC_HECC_TESTCB13_TCB_Pos)          /**< (HEFC_HECC_TESTCB13) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB13_TCB(value)         (HEFC_HECC_TESTCB13_TCB_Msk & ((value) << HEFC_HECC_TESTCB13_TCB_Pos))
#define HEFC_HECC_TESTCB13_Msk                _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB13) Register Mask  */


/* -------- HEFC_HECC_TESTCB14 : (HEFC Offset: 0x178) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 14 -------- */
#define HEFC_HECC_TESTCB14_TCB_Pos            _U_(0)                                               /**< (HEFC_HECC_TESTCB14) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB14_TCB_Msk            (_U_(0xFFFF) << HEFC_HECC_TESTCB14_TCB_Pos)          /**< (HEFC_HECC_TESTCB14) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB14_TCB(value)         (HEFC_HECC_TESTCB14_TCB_Msk & ((value) << HEFC_HECC_TESTCB14_TCB_Pos))
#define HEFC_HECC_TESTCB14_Msk                _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB14) Register Mask  */


/* -------- HEFC_HECC_TESTCB15 : (HEFC Offset: 0x17C) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 15 -------- */
#define HEFC_HECC_TESTCB15_TCB_Pos            _U_(0)                                               /**< (HEFC_HECC_TESTCB15) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB15_TCB_Msk            (_U_(0xFFFF) << HEFC_HECC_TESTCB15_TCB_Pos)          /**< (HEFC_HECC_TESTCB15) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB15_TCB(value)         (HEFC_HECC_TESTCB15_TCB_Msk & ((value) << HEFC_HECC_TESTCB15_TCB_Pos))
#define HEFC_HECC_TESTCB15_Msk                _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB15) Register Mask  */


/* -------- HEFC_HECC_SR : (HEFC Offset: 0x180) ( R/ 32) HECC Status register -------- */
#define HEFC_HECC_SR_MEM_FIX_Pos              _U_(0)                                               /**< (HEFC_HECC_SR) Fixable error status Position */
#define HEFC_HECC_SR_MEM_FIX_Msk              (_U_(0x1) << HEFC_HECC_SR_MEM_FIX_Pos)               /**< (HEFC_HECC_SR) Fixable error status Mask */
#define HEFC_HECC_SR_MEM_FIX(value)           (HEFC_HECC_SR_MEM_FIX_Msk & ((value) << HEFC_HECC_SR_MEM_FIX_Pos))
#define HEFC_HECC_SR_CPT_FIX_Pos              _U_(2)                                               /**< (HEFC_HECC_SR) 5 bits counter Position */
#define HEFC_HECC_SR_CPT_FIX_Msk              (_U_(0x1F) << HEFC_HECC_SR_CPT_FIX_Pos)              /**< (HEFC_HECC_SR) 5 bits counter Mask */
#define HEFC_HECC_SR_CPT_FIX(value)           (HEFC_HECC_SR_CPT_FIX_Msk & ((value) << HEFC_HECC_SR_CPT_FIX_Pos))
#define HEFC_HECC_SR_OVER_FIX_Pos             _U_(7)                                               /**< (HEFC_HECC_SR) counter overflow Position */
#define HEFC_HECC_SR_OVER_FIX_Msk             (_U_(0x1) << HEFC_HECC_SR_OVER_FIX_Pos)              /**< (HEFC_HECC_SR) counter overflow Mask */
#define HEFC_HECC_SR_OVER_FIX(value)          (HEFC_HECC_SR_OVER_FIX_Msk & ((value) << HEFC_HECC_SR_OVER_FIX_Pos))
#define HEFC_HECC_SR_MEM_NOFIX_Pos            _U_(8)                                               /**< (HEFC_HECC_SR) Un-fixable error status Position */
#define HEFC_HECC_SR_MEM_NOFIX_Msk            (_U_(0x1) << HEFC_HECC_SR_MEM_NOFIX_Pos)             /**< (HEFC_HECC_SR) Un-fixable error status Mask */
#define HEFC_HECC_SR_MEM_NOFIX(value)         (HEFC_HECC_SR_MEM_NOFIX_Msk & ((value) << HEFC_HECC_SR_MEM_NOFIX_Pos))
#define HEFC_HECC_SR_CPT_NOFIX_Pos            _U_(10)                                              /**< (HEFC_HECC_SR) 5 bits counter Position */
#define HEFC_HECC_SR_CPT_NOFIX_Msk            (_U_(0x1F) << HEFC_HECC_SR_CPT_NOFIX_Pos)            /**< (HEFC_HECC_SR) 5 bits counter Mask */
#define HEFC_HECC_SR_CPT_NOFIX(value)         (HEFC_HECC_SR_CPT_NOFIX_Msk & ((value) << HEFC_HECC_SR_CPT_NOFIX_Pos))
#define HEFC_HECC_SR_OVER_NOFIX_Pos           _U_(15)                                              /**< (HEFC_HECC_SR) counter overflow Position */
#define HEFC_HECC_SR_OVER_NOFIX_Msk           (_U_(0x1) << HEFC_HECC_SR_OVER_NOFIX_Pos)            /**< (HEFC_HECC_SR) counter overflow Mask */
#define HEFC_HECC_SR_OVER_NOFIX(value)        (HEFC_HECC_SR_OVER_NOFIX_Msk & ((value) << HEFC_HECC_SR_OVER_NOFIX_Pos))
#define HEFC_HECC_SR_HES_Pos                  _U_(24)                                              /**< (HEFC_HECC_SR) Hardware Error Size Position */
#define HEFC_HECC_SR_HES_Msk                  (_U_(0x7) << HEFC_HECC_SR_HES_Pos)                   /**< (HEFC_HECC_SR) Hardware Error Size Mask */
#define HEFC_HECC_SR_HES(value)               (HEFC_HECC_SR_HES_Msk & ((value) << HEFC_HECC_SR_HES_Pos))
#define HEFC_HECC_SR_TYPE_Pos                 _U_(27)                                              /**< (HEFC_HECC_SR) write or read access Position */
#define HEFC_HECC_SR_TYPE_Msk                 (_U_(0x1) << HEFC_HECC_SR_TYPE_Pos)                  /**< (HEFC_HECC_SR) write or read access Mask */
#define HEFC_HECC_SR_TYPE(value)              (HEFC_HECC_SR_TYPE_Msk & ((value) << HEFC_HECC_SR_TYPE_Pos))
#define HEFC_HECC_SR_MEM_ID_Pos               _U_(28)                                              /**< (HEFC_HECC_SR) memory identification number Position */
#define HEFC_HECC_SR_MEM_ID_Msk               (_U_(0x3) << HEFC_HECC_SR_MEM_ID_Pos)                /**< (HEFC_HECC_SR) memory identification number Mask */
#define HEFC_HECC_SR_MEM_ID(value)            (HEFC_HECC_SR_MEM_ID_Msk & ((value) << HEFC_HECC_SR_MEM_ID_Pos))
#define HEFC_HECC_SR_Msk                      _U_(0x3F00FDFD)                                      /**< (HEFC_HECC_SR) Register Mask  */


/* -------- HEFC_HECC_IER : (HEFC Offset: 0x184) ( /W 32) HECC Interrupt Enable Register -------- */
#define HEFC_HECC_IER_MEM_FIX_Pos             _U_(0)                                               /**< (HEFC_HECC_IER) Fixable error Position */
#define HEFC_HECC_IER_MEM_FIX_Msk             (_U_(0x1) << HEFC_HECC_IER_MEM_FIX_Pos)              /**< (HEFC_HECC_IER) Fixable error Mask */
#define HEFC_HECC_IER_MEM_FIX(value)          (HEFC_HECC_IER_MEM_FIX_Msk & ((value) << HEFC_HECC_IER_MEM_FIX_Pos))
#define HEFC_HECC_IER_MEM_NOFIX_Pos           _U_(1)                                               /**< (HEFC_HECC_IER) Un-fixable error Position */
#define HEFC_HECC_IER_MEM_NOFIX_Msk           (_U_(0x1) << HEFC_HECC_IER_MEM_NOFIX_Pos)            /**< (HEFC_HECC_IER) Un-fixable error Mask */
#define HEFC_HECC_IER_MEM_NOFIX(value)        (HEFC_HECC_IER_MEM_NOFIX_Msk & ((value) << HEFC_HECC_IER_MEM_NOFIX_Pos))
#define HEFC_HECC_IER_Msk                     _U_(0x00000003)                                      /**< (HEFC_HECC_IER) Register Mask  */


