Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hefc.h
/* -------- HEFC_HECC_IDR : (HEFC Offset: 0x188) ( /W 32) HECC Interrupt Disable Register -------- */
#define HEFC_HECC_IDR_MEM_FIX_Pos             _U_(0)                                               /**< (HEFC_HECC_IDR) fixable error Position */
#define HEFC_HECC_IDR_MEM_FIX_Msk             (_U_(0x1) << HEFC_HECC_IDR_MEM_FIX_Pos)              /**< (HEFC_HECC_IDR) fixable error Mask */
#define HEFC_HECC_IDR_MEM_FIX(value)          (HEFC_HECC_IDR_MEM_FIX_Msk & ((value) << HEFC_HECC_IDR_MEM_FIX_Pos))
#define HEFC_HECC_IDR_MEM_NOFIX_Pos           _U_(1)                                               /**< (HEFC_HECC_IDR) un-fixable error Position */
#define HEFC_HECC_IDR_MEM_NOFIX_Msk           (_U_(0x1) << HEFC_HECC_IDR_MEM_NOFIX_Pos)            /**< (HEFC_HECC_IDR) un-fixable error Mask */
#define HEFC_HECC_IDR_MEM_NOFIX(value)        (HEFC_HECC_IDR_MEM_NOFIX_Msk & ((value) << HEFC_HECC_IDR_MEM_NOFIX_Pos))
#define HEFC_HECC_IDR_Msk                     _U_(0x00000003)                                      /**< (HEFC_HECC_IDR) Register Mask  */


/* -------- HEFC_HECC_IMR : (HEFC Offset: 0x18C) ( R/ 32) HECC Interrupt Mask Register -------- */
#define HEFC_HECC_IMR_MEM_FIX_Pos             _U_(0)                                               /**< (HEFC_HECC_IMR) fixable error Position */
#define HEFC_HECC_IMR_MEM_FIX_Msk             (_U_(0x1) << HEFC_HECC_IMR_MEM_FIX_Pos)              /**< (HEFC_HECC_IMR) fixable error Mask */
#define HEFC_HECC_IMR_MEM_FIX(value)          (HEFC_HECC_IMR_MEM_FIX_Msk & ((value) << HEFC_HECC_IMR_MEM_FIX_Pos))
#define HEFC_HECC_IMR_MEM_NOFIX_Pos           _U_(1)                                               /**< (HEFC_HECC_IMR) un-fixable error Position */
#define HEFC_HECC_IMR_MEM_NOFIX_Msk           (_U_(0x1) << HEFC_HECC_IMR_MEM_NOFIX_Pos)            /**< (HEFC_HECC_IMR) un-fixable error Mask */
#define HEFC_HECC_IMR_MEM_NOFIX(value)        (HEFC_HECC_IMR_MEM_NOFIX_Msk & ((value) << HEFC_HECC_IMR_MEM_NOFIX_Pos))
#define HEFC_HECC_IMR_Msk                     _U_(0x00000003)                                      /**< (HEFC_HECC_IMR) Register Mask  */


/* -------- HEFC_HECC_FAILAR : (HEFC Offset: 0x190) ( R/ 32) HECC Fail address register -------- */
#define HEFC_HECC_FAILAR_ADDRESS_Pos          _U_(0)                                               /**< (HEFC_HECC_FAILAR) address of the error detected Position */
#define HEFC_HECC_FAILAR_ADDRESS_Msk          (_U_(0xFFFFFFFF) << HEFC_HECC_FAILAR_ADDRESS_Pos)    /**< (HEFC_HECC_FAILAR) address of the error detected Mask */
#define HEFC_HECC_FAILAR_ADDRESS(value)       (HEFC_HECC_FAILAR_ADDRESS_Msk & ((value) << HEFC_HECC_FAILAR_ADDRESS_Pos))
#define HEFC_HECC_FAILAR_Msk                  _U_(0xFFFFFFFF)                                      /**< (HEFC_HECC_FAILAR) Register Mask  */


/* -------- HEFC_GPNVM_MISC : (HEFC Offset: 0x00) (R/W 32) HEFC GPNVM word miscellaneous -------- */
#define HEFC_GPNVM_MISC_DEBUG_INTF_Pos        _U_(1)                                               /**< (HEFC_GPNVM_MISC) Debug interface Selection Position */
#define HEFC_GPNVM_MISC_DEBUG_INTF_Msk        (_U_(0x1) << HEFC_GPNVM_MISC_DEBUG_INTF_Pos)         /**< (HEFC_GPNVM_MISC) Debug interface Selection Mask */
#define HEFC_GPNVM_MISC_DEBUG_INTF(value)     (HEFC_GPNVM_MISC_DEBUG_INTF_Msk & ((value) << HEFC_GPNVM_MISC_DEBUG_INTF_Pos))
#define   HEFC_GPNVM_MISC_DEBUG_INTF_JTAG_Val _U_(0x0)                                             /**< (HEFC_GPNVM_MISC) JTAG  */
#define   HEFC_GPNVM_MISC_DEBUG_INTF_SWD_Val  _U_(0x1)                                             /**< (HEFC_GPNVM_MISC) SWD  */
#define HEFC_GPNVM_MISC_DEBUG_INTF_JTAG       (HEFC_GPNVM_MISC_DEBUG_INTF_JTAG_Val << HEFC_GPNVM_MISC_DEBUG_INTF_Pos) /**< (HEFC_GPNVM_MISC) JTAG Position  */
#define HEFC_GPNVM_MISC_DEBUG_INTF_SWD        (HEFC_GPNVM_MISC_DEBUG_INTF_SWD_Val << HEFC_GPNVM_MISC_DEBUG_INTF_Pos) /**< (HEFC_GPNVM_MISC) SWD Position  */
#define HEFC_GPNVM_MISC_PFD_TRIM_Pos          _U_(8)                                               /**< (HEFC_GPNVM_MISC) PFD Trim value Position */
#define HEFC_GPNVM_MISC_PFD_TRIM_Msk          (_U_(0x7) << HEFC_GPNVM_MISC_PFD_TRIM_Pos)           /**< (HEFC_GPNVM_MISC) PFD Trim value Mask */
#define HEFC_GPNVM_MISC_PFD_TRIM(value)       (HEFC_GPNVM_MISC_PFD_TRIM_Msk & ((value) << HEFC_GPNVM_MISC_PFD_TRIM_Pos))
#define HEFC_GPNVM_MISC_Msk                   _U_(0x00000702)                                      /**< (HEFC_GPNVM_MISC) Register Mask  */


/* -------- HEFC_GPNVM_RC_TRIM : (HEFC Offset: 0x04) (R/W 32) HEFC GPNVM word RC trim (1..3) -------- */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM_Pos       _U_(0)                                               /**< (HEFC_GPNVM_RC_TRIM) RC Temperature Trim Position */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM_Msk       (_U_(0x3) << HEFC_GPNVM_RC_TRIM_RC_TTRIM_Pos)        /**< (HEFC_GPNVM_RC_TRIM) RC Temperature Trim Mask */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM(value)    (HEFC_GPNVM_RC_TRIM_RC_TTRIM_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC_TTRIM_Pos))
#define HEFC_GPNVM_RC_TRIM_RC2_TTRIM_Pos      _U_(2)                                               /**< (HEFC_GPNVM_RC_TRIM) RC2 Temperature Trim Position */
#define HEFC_GPNVM_RC_TRIM_RC2_TTRIM_Msk      (_U_(0x3) << HEFC_GPNVM_RC_TRIM_RC2_TTRIM_Pos)       /**< (HEFC_GPNVM_RC_TRIM) RC2 Temperature Trim Mask */
#define HEFC_GPNVM_RC_TRIM_RC2_TTRIM(value)   (HEFC_GPNVM_RC_TRIM_RC2_TTRIM_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC2_TTRIM_Pos))
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_4MHZ_Pos  _U_(4)                                               /**< (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 4MHz Position */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_4MHZ_Msk  (_U_(0x7) << HEFC_GPNVM_RC_TRIM_RC_FTRIM_4MHZ_Pos)   /**< (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 4MHz Mask */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_4MHZ(value) (HEFC_GPNVM_RC_TRIM_RC_FTRIM_4MHZ_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC_FTRIM_4MHZ_Pos))
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_8MHZ_Pos  _U_(7)                                               /**< (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 8MHz Position */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_8MHZ_Msk  (_U_(0x7) << HEFC_GPNVM_RC_TRIM_RC_FTRIM_8MHZ_Pos)   /**< (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 8MHz Mask */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_8MHZ(value) (HEFC_GPNVM_RC_TRIM_RC_FTRIM_8MHZ_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC_FTRIM_8MHZ_Pos))
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_10MHZ_Pos _U_(10)                                              /**< (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 10MHz Position */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_10MHZ_Msk (_U_(0x7) << HEFC_GPNVM_RC_TRIM_RC_FTRIM_10MHZ_Pos)  /**< (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 10MHz Mask */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_10MHZ(value) (HEFC_GPNVM_RC_TRIM_RC_FTRIM_10MHZ_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC_FTRIM_10MHZ_Pos))
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_12MHZ_Pos _U_(13)                                              /**< (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 12MHz Position */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_12MHZ_Msk (_U_(0x7) << HEFC_GPNVM_RC_TRIM_RC_FTRIM_12MHZ_Pos)  /**< (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 12MHz Mask */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM_12MHZ(value) (HEFC_GPNVM_RC_TRIM_RC_FTRIM_12MHZ_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC_FTRIM_12MHZ_Pos))
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_4MHZ_Pos _U_(16)                                              /**< (HEFC_GPNVM_RC_TRIM) RC2 Frequency Trim 4MHz Position */
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_4MHZ_Msk (_U_(0x7) << HEFC_GPNVM_RC_TRIM_RC2_FTRIM_4MHZ_Pos)  /**< (HEFC_GPNVM_RC_TRIM) RC2 Frequency Trim 4MHz Mask */
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_4MHZ(value) (HEFC_GPNVM_RC_TRIM_RC2_FTRIM_4MHZ_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC2_FTRIM_4MHZ_Pos))
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_8MHZ_Pos _U_(19)                                              /**< (HEFC_GPNVM_RC_TRIM) RC2 Frequency Trim 8MHz Position */
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_8MHZ_Msk (_U_(0x7) << HEFC_GPNVM_RC_TRIM_RC2_FTRIM_8MHZ_Pos)  /**< (HEFC_GPNVM_RC_TRIM) RC2 Frequency Trim 8MHz Mask */
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_8MHZ(value) (HEFC_GPNVM_RC_TRIM_RC2_FTRIM_8MHZ_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC2_FTRIM_8MHZ_Pos))
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_10MHZ_Pos _U_(22)                                              /**< (HEFC_GPNVM_RC_TRIM) RC2 Frequency Trim 10MHz Position */
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_10MHZ_Msk (_U_(0x7) << HEFC_GPNVM_RC_TRIM_RC2_FTRIM_10MHZ_Pos) /**< (HEFC_GPNVM_RC_TRIM) RC2 Frequency Trim 10MHz Mask */
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_10MHZ(value) (HEFC_GPNVM_RC_TRIM_RC2_FTRIM_10MHZ_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC2_FTRIM_10MHZ_Pos))
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_12MHZ_Pos _U_(25)                                              /**< (HEFC_GPNVM_RC_TRIM) RC2 Frequency Trim 12MHz Position */
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_12MHZ_Msk (_U_(0x7) << HEFC_GPNVM_RC_TRIM_RC2_FTRIM_12MHZ_Pos) /**< (HEFC_GPNVM_RC_TRIM) RC2 Frequency Trim 12MHz Mask */
#define HEFC_GPNVM_RC_TRIM_RC2_FTRIM_12MHZ(value) (HEFC_GPNVM_RC_TRIM_RC2_FTRIM_12MHZ_Msk & ((value) << HEFC_GPNVM_RC_TRIM_RC2_FTRIM_12MHZ_Pos))
#define HEFC_GPNVM_RC_TRIM_Msk                _U_(0x0FFFFFFF)                                      /**< (HEFC_GPNVM_RC_TRIM) Register Mask  */


/** \brief HEFC register offsets definitions */
#define HEFC_FMR_REG_OFST              (0x00)              /**< (HEFC_FMR) HEFC Flash Mode Register Offset */
#define HEFC_FCR_REG_OFST              (0x04)              /**< (HEFC_FCR) HEFC Flash Command Register Offset */
#define HEFC_FSR_REG_OFST              (0x08)              /**< (HEFC_FSR) HEFC Flash Status Register Offset */
#define HEFC_FRR_REG_OFST              (0x0C)              /**< (HEFC_FRR) HEFC Flash Result Register Offset */
#define HEFC_FPMR_REG_OFST             (0x40)              /**< (HEFC_FPMR) HEFC Flash Power Management Register Offset */
#define HEFC_WPMR_REG_OFST             (0xE4)              /**< (HEFC_WPMR) Write Protection Mode Register Offset */
#define HEFC_HECC_CR0_REG_OFST         (0x100)             /**< (HEFC_HECC_CR0) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 0 Offset */
#define HEFC_HECC_CR1_REG_OFST         (0x104)             /**< (HEFC_HECC_CR1) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 1 Offset */
#define HEFC_HECC_CR2_REG_OFST         (0x108)             /**< (HEFC_HECC_CR2) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 2 Offset */
#define HEFC_HECC_CR3_REG_OFST         (0x10C)             /**< (HEFC_HECC_CR3) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 3 Offset */
#define HEFC_HECC_CR4_REG_OFST         (0x110)             /**< (HEFC_HECC_CR4) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 4 Offset */
#define HEFC_HECC_CR5_REG_OFST         (0x114)             /**< (HEFC_HECC_CR5) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 5 Offset */
#define HEFC_HECC_CR6_REG_OFST         (0x118)             /**< (HEFC_HECC_CR6) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 6 Offset */
#define HEFC_HECC_CR7_REG_OFST         (0x11C)             /**< (HEFC_HECC_CR7) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 7 Offset */
#define HEFC_HECC_CR8_REG_OFST         (0x120)             /**< (HEFC_HECC_CR8) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 8 Offset */
#define HEFC_HECC_CR9_REG_OFST         (0x124)             /**< (HEFC_HECC_CR9) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 9 Offset */
#define HEFC_HECC_CR10_REG_OFST        (0x128)             /**< (HEFC_HECC_CR10) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 10 Offset */
#define HEFC_HECC_CR11_REG_OFST        (0x12C)             /**< (HEFC_HECC_CR11) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 11 Offset */
#define HEFC_HECC_CR12_REG_OFST        (0x130)             /**< (HEFC_HECC_CR12) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 12 Offset */
#define HEFC_HECC_CR13_REG_OFST        (0x134)             /**< (HEFC_HECC_CR13) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 13 Offset */
#define HEFC_HECC_CR14_REG_OFST        (0x138)             /**< (HEFC_HECC_CR14) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 14 Offset */
#define HEFC_HECC_CR15_REG_OFST        (0x13C)             /**< (HEFC_HECC_CR15) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 15 Offset */
#define HEFC_HECC_TESTCB0_REG_OFST     (0x140)             /**< (HEFC_HECC_TESTCB0) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 0 Offset */
#define HEFC_HECC_TESTCB1_REG_OFST     (0x144)             /**< (HEFC_HECC_TESTCB1) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 1 Offset */
#define HEFC_HECC_TESTCB2_REG_OFST     (0x148)             /**< (HEFC_HECC_TESTCB2) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 2 Offset */
#define HEFC_HECC_TESTCB3_REG_OFST     (0x14C)             /**< (HEFC_HECC_TESTCB3) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 3 Offset */
#define HEFC_HECC_TESTCB4_REG_OFST     (0x150)             /**< (HEFC_HECC_TESTCB4) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 4 Offset */
#define HEFC_HECC_TESTCB5_REG_OFST     (0x154)             /**< (HEFC_HECC_TESTCB5) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 5 Offset */
#define HEFC_HECC_TESTCB6_REG_OFST     (0x158)             /**< (HEFC_HECC_TESTCB6) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 6 Offset */
#define HEFC_HECC_TESTCB7_REG_OFST     (0x15C)             /**< (HEFC_HECC_TESTCB7) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 7 Offset */
#define HEFC_HECC_TESTCB8_REG_OFST     (0x160)             /**< (HEFC_HECC_TESTCB8) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 8 Offset */
#define HEFC_HECC_TESTCB9_REG_OFST     (0x164)             /**< (HEFC_HECC_TESTCB9) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 9 Offset */
#define HEFC_HECC_TESTCB10_REG_OFST    (0x168)             /**< (HEFC_HECC_TESTCB10) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 10 Offset */
#define HEFC_HECC_TESTCB11_REG_OFST    (0x16C)             /**< (HEFC_HECC_TESTCB11) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 11 Offset */
#define HEFC_HECC_TESTCB12_REG_OFST    (0x170)             /**< (HEFC_HECC_TESTCB12) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 12 Offset */
#define HEFC_HECC_TESTCB13_REG_OFST    (0x174)             /**< (HEFC_HECC_TESTCB13) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 13 Offset */
#define HEFC_HECC_TESTCB14_REG_OFST    (0x178)             /**< (HEFC_HECC_TESTCB14) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 14 Offset */
#define HEFC_HECC_TESTCB15_REG_OFST    (0x17C)             /**< (HEFC_HECC_TESTCB15) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 15 Offset */
#define HEFC_HECC_SR_REG_OFST          (0x180)             /**< (HEFC_HECC_SR) HECC Status register Offset */
#define HEFC_HECC_IER_REG_OFST         (0x184)             /**< (HEFC_HECC_IER) HECC Interrupt Enable Register Offset */
#define HEFC_HECC_IDR_REG_OFST         (0x188)             /**< (HEFC_HECC_IDR) HECC Interrupt Disable Register Offset */
#define HEFC_HECC_IMR_REG_OFST         (0x18C)             /**< (HEFC_HECC_IMR) HECC Interrupt Mask Register Offset */
#define HEFC_HECC_FAILAR_REG_OFST      (0x190)             /**< (HEFC_HECC_FAILAR) HECC Fail address register Offset */
#define HEFC_GPNVM_MISC_REG_OFST       (0x00)              /**< (HEFC_GPNVM_MISC) HEFC GPNVM word miscellaneous Offset */
#define HEFC_GPNVM_RC_TRIM_REG_OFST    (0x04)              /**< (HEFC_GPNVM_RC_TRIM) HEFC GPNVM word RC trim (1..3) Offset */

