Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hefc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief HEFC register API structure */
typedef struct
{
  __IO  uint32_t                       HEFC_FMR;           /**< Offset: 0x00 (R/W  32) HEFC Flash Mode Register */
  __O   uint32_t                       HEFC_FCR;           /**< Offset: 0x04 ( /W  32) HEFC Flash Command Register */
  __I   uint32_t                       HEFC_FSR;           /**< Offset: 0x08 (R/   32) HEFC Flash Status Register */
  __I   uint32_t                       HEFC_FRR;           /**< Offset: 0x0C (R/   32) HEFC Flash Result Register */
  __I   uint8_t                        Reserved1[0x30];
  __IO  uint32_t                       HEFC_FPMR;          /**< Offset: 0x40 (R/W  32) HEFC Flash Power Management Register */
  __I   uint8_t                        Reserved2[0xA0];
  __IO  uint32_t                       HEFC_WPMR;          /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint8_t                        Reserved3[0x18];
  __IO  uint32_t                       HEFC_HECC_CR0;      /**< Offset: 0x100 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 0 */
  __IO  uint32_t                       HEFC_HECC_CR1;      /**< Offset: 0x104 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 1 */
  __IO  uint32_t                       HEFC_HECC_CR2;      /**< Offset: 0x108 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 2 */
  __IO  uint32_t                       HEFC_HECC_CR3;      /**< Offset: 0x10C (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 3 */
  __IO  uint32_t                       HEFC_HECC_CR4;      /**< Offset: 0x110 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 4 */
  __IO  uint32_t                       HEFC_HECC_CR5;      /**< Offset: 0x114 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 5 */
  __IO  uint32_t                       HEFC_HECC_CR6;      /**< Offset: 0x118 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 6 */
  __IO  uint32_t                       HEFC_HECC_CR7;      /**< Offset: 0x11C (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 7 */
  __IO  uint32_t                       HEFC_HECC_CR8;      /**< Offset: 0x120 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 8 */
  __IO  uint32_t                       HEFC_HECC_CR9;      /**< Offset: 0x124 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 9 */
  __IO  uint32_t                       HEFC_HECC_CR10;     /**< Offset: 0x128 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 10 */
  __IO  uint32_t                       HEFC_HECC_CR11;     /**< Offset: 0x12C (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 11 */
  __IO  uint32_t                       HEFC_HECC_CR12;     /**< Offset: 0x130 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 12 */
  __IO  uint32_t                       HEFC_HECC_CR13;     /**< Offset: 0x134 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 13 */
  __IO  uint32_t                       HEFC_HECC_CR14;     /**< Offset: 0x138 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 14 */
  __IO  uint32_t                       HEFC_HECC_CR15;     /**< Offset: 0x13C (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 15 */
  __IO  uint32_t                       HEFC_HECC_TESTCB0;  /**< Offset: 0x140 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 0 */
  __IO  uint32_t                       HEFC_HECC_TESTCB1;  /**< Offset: 0x144 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 1 */
  __IO  uint32_t                       HEFC_HECC_TESTCB2;  /**< Offset: 0x148 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 2 */
  __IO  uint32_t                       HEFC_HECC_TESTCB3;  /**< Offset: 0x14C (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 3 */
  __IO  uint32_t                       HEFC_HECC_TESTCB4;  /**< Offset: 0x150 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 4 */
  __IO  uint32_t                       HEFC_HECC_TESTCB5;  /**< Offset: 0x154 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 5 */
  __IO  uint32_t                       HEFC_HECC_TESTCB6;  /**< Offset: 0x158 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 6 */
  __IO  uint32_t                       HEFC_HECC_TESTCB7;  /**< Offset: 0x15C (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 7 */
  __IO  uint32_t                       HEFC_HECC_TESTCB8;  /**< Offset: 0x160 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 8 */
  __IO  uint32_t                       HEFC_HECC_TESTCB9;  /**< Offset: 0x164 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 9 */
  __IO  uint32_t                       HEFC_HECC_TESTCB10; /**< Offset: 0x168 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 10 */
  __IO  uint32_t                       HEFC_HECC_TESTCB11; /**< Offset: 0x16C (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 11 */
  __IO  uint32_t                       HEFC_HECC_TESTCB12; /**< Offset: 0x170 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 12 */
  __IO  uint32_t                       HEFC_HECC_TESTCB13; /**< Offset: 0x174 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 13 */
  __IO  uint32_t                       HEFC_HECC_TESTCB14; /**< Offset: 0x178 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 14 */
  __IO  uint32_t                       HEFC_HECC_TESTCB15; /**< Offset: 0x17C (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 15 */
  __I   uint32_t                       HEFC_HECC_SR;       /**< Offset: 0x180 (R/   32) HECC Status register */
  __O   uint32_t                       HEFC_HECC_IER;      /**< Offset: 0x184 ( /W  32) HECC Interrupt Enable Register */
  __O   uint32_t                       HEFC_HECC_IDR;      /**< Offset: 0x188 ( /W  32) HECC Interrupt Disable Register */
  __I   uint32_t                       HEFC_HECC_IMR;      /**< Offset: 0x18C (R/   32) HECC Interrupt Mask Register */
  __I   uint32_t                       HEFC_HECC_FAILAR;   /**< Offset: 0x190 (R/   32) HECC Fail address register */
} hefc_registers_t;

/** \brief GPNVMBITS register API structure */
typedef struct
{  /* GPNVM Bits */
  __IO  uint32_t                       HEFC_GPNVM_MISC;    /**< Offset: 0x00 (R/W  32) HEFC GPNVM word miscellaneous */
  __IO  uint32_t                       HEFC_GPNVM_RC_TRIM[3]; /**< Offset: 0x04 (R/W  32) HEFC GPNVM word RC trim (1..3) */
} hefc_gpnvmbits_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH71_HEFC_COMPONENT_H_ */
